# -*- coding:utf-8 -*-

# Call By Value, Call By Reference
# Python 버전
#   - 파이썬은 참조형(객체) 밖에 없음 -> Value는 없음
#   - 내부적으로는 자바에 비해 난리 났는데 결과는 동일

d = 1
e = 1
def change(a, b, c):
    print(a, b[0], c[0])    # 1, 1, 1
    global e
    a = 10
    b[0] = 10
    c = [10,20]
    d = 10
    e = 10
    print(a, b[0], c[0], d, e)    # 10, 10, 10, 10, 10

a = 1
b = [1, 2]
c = [1, 2]
print(a, b[0], c[0], d, e)        # 1, 1, 1, 1, 1
change(a,b,c)       
print(a, b[0], c[0], d, e)        # 1, 10, 1, 1, 10 

#                       메모리 상황
#    static          stack                    heap
#-----------------------------------------------------------
#    16  d            #7                    #7(d=10)
#  12=9  e            #4
#    11  c         #90 -> #88             #88(c=[10,20])
#    11  b            #56           
#    11  a         #2 -> #34                #34(a=10)
#                                          
#    22  c           #90                   #90(c=[1,2])
#    21  b           #56            #56(b=[1,2]) -> (b=[10,2])
#    20  a            #2                    #2(a=1)
#    9   e            #4                #4(e=1) -> (e=10)
#    8   d            #6                    #6(d=1)